/* Algorithm Names. */

/* The key is the numeric value as defined in cssmtype.h in Apple's Security framework.  Last updated for 10.3.9. */
/* The value is human-readable name for the algorithm. */

/* Standard algorithms, defined in CDSA spec. */

0 = "None";
1 = "Custom";
2 = "DH";
3 = "PH";
4 = "KEA";
5 = "MD2";
6 = "MD4";
7 = "MD5";
8 = "SHA1";
9 = "NHASH";
10 = "HAVAL";
11 = "RIPEMD";
12 = "IBCHASH";
13 = "RIPEMAC";
14 = "DES";
15 = "DESX";
16 = "RDES";
17 = "3-Key TripleDES EDE";
18 = "2-Key TripleDES EDE";
19 = "1-Key TripleDES EEE";
20 = "3-Key TripleDES EEE";
21 = "2-Key TripleDES EEE";
22 = "IDEA";
23 = "RC2";
24 = "RC5";
25 = "RC4";
26 = "SEAL";
27 = "CAST";
28 = "Blowfish";
29 = "Skipjack";
30 = "Lucifer";
31 = "Madryga";
32 = "FEAL";
33 = "REDOC";
34 = "REDOC3";
35 = "LOKI";
36 = "KHUFU";
37 = "KHAFRE";
38 = "MMB";
39 = "GOST";
40 = "SAFER";
41 = "CRAB";
42 = "RSA";
43 = "DSA";
44 = "MD5 with RSA";
45 = "MD2 with RSA";
46 = "El Gamal";
47 = "MD2 Random";
48 = "MD5 Random";
49 = "SHA Random";
50 = "DES Random";
51 = "SHA1 with RSA";
52 = "CDMF";
53 = "CAST3";
54 = "CAST5";
55 = "Generic Secret";
56 = "Concat Base and Key";
57 = "Concat Key and Base";
58 = "Concat Base and Data";
59 = "Concat Data and Base";
60 = "XOR Base and Data";
61 = "Extract from Key";
62 = "SSL3 Pre-Master Gen";
63 = "SSL3 Master Derive";
64 = "SSL3 Key & MAC Derive";
65 = "SSL3 MD5-MAC";
66 = "SSL3 SHA1-MAC";
67 = "PKCS5 PBKDF1 MD5";
68 = "PKCS5 PBKDF1 MD2";
69 = "PKCS5 PBKDF1 SHA1";
70 = "WrapLynks";
71 = "WrapSET OAEP";
72 = "BATON";
73 = "ECDSA";
74 = "Mayfly";
75 = "Juniper";
76 = "Fasthash";
77 = "TripleDES";
78 = "SSL3 MD5";
79 = "SSL3 SHA1";
80 = "Fortezza Timestamp";
81 = "SHA1 with DSA";
82 = "SHA1 with ECDSA";
83 = "DSA Bsafe";
84 = "ECDH";
85 = "ECMQV";
86 = "PKCS12 SHA1 PBE";
87 = "ECNRA";
88 = "SHA1 with ECNRA";
89 = "ECES";
90 = "ECAES";
91 = "SHA1 HMAC";
92 = "FIPS 186 Random";
93 = "ECC";
94 = "MQV";
95 = "NRA";
96 = "Intel Platform Random";
97 = "UTC";
98 = "HAVAL3";
99 = "HACAL4";
100 = "HAVAL5";
101 = "TIGER";
102 = "MD5 HMAC";
103 = "PKCS5 PBKDF2";
104 = "Running Counter";

/* Apple's Algorithms */

2147483648 = "Apple Yarrow";
2147483649 = "AES (RijnDael)";
2147483650 = "FEE Key Generation";
2147483651 = "FEE/ElGamal signature with MD5 hash";
2147483652 = "FEE/ElGamal signature with SHA1 hash";
2147483653 = "1:1 FEE asymmetric";
2147483654 = "2:1 FEE asymmetric";
2147483655 = "Apple Secure Compression";
2147483656 = "Legacy SHA1-HMAC";
2147483657 = "Keychain Key";
2147483658 = "PKCS12 PBE Encrypt/Decrypt Key";
2147483659 = "PKCS12 PBE MAC Key";
2147483660 = "Secure Passphrase (from SecurityServer)";
2147483661 = "OpenSSL MD5 Key Derivation";
2147483662 = "SHA2-256";
2147483663 = "SHA2-384";
2147483664 = "SHA2-512";
2147483665 = "Default Entropy Source";
2147483666 = "SHA2-224";
2147483667 = "RSA signature on SHA2-224 digest";
2147483668 = "RSA signature on SHA2-256 digest";
2147483669 = "RSA signature on SHA2-384 digest";
2147483670 = "RSA signature on SHA2-512 digest";